# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-Ghost-Only object detection model (Remove EMA for faster FPS)
parameters:
  nc: 1  # 记得改成你的数据集类别数
  scales: # 保持原样
    n: [0.33, 0.25, 1024] 
    s: [0.33, 0.50, 1024]
    m: [0.67, 0.75, 768]
    l: [1.00, 1.00, 512]
    x: [1.00, 1.25, 512]

# YOLOv8 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f_Ghost, [128, True]] # 2 替换为 C2f_Ghost
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f_Ghost, [256, True]] # 4 替换为 C2f_Ghost
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_Ghost, [512, True]] # 6 替换为 C2f_Ghost
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f_Ghost, [1024, True]] # 8 替换为 C2f_Ghost
  - [-1, 1, SPPF, [1024, 5]]  # 9

# ================= 这里把 EMA 注意力机制整行删掉了 =================

# YOLOv8 head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f_Ghost, [512]]  # 12 替换为 C2f_Ghost (索引变回去了)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f_Ghost, [256]]  # 15 (P3/8-small) 替换为 C2f_Ghost (索引变回去了)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4 (这里的索引从13变回了12)
  - [-1, 3, C2f_Ghost, [512]]  # 18 (P4/16-medium) 替换为 C2f_Ghost (索引变回去了)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # 【核心修正】以前连EMA(10)，现在必须连回SPPF(9) (cat head P5)
  - [-1, 3, C2f_Ghost, [1024]] # 21 (P5/32-large) 替换为 C2f_Ghost (索引变回去了)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5) (这里的索引也相应修正)