# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-Ghost-EMA object detection model
parameters:
  nc: 1  # 这里记得改成你数据集的类别数！
  scales: # 保持原样即可
    n: [0.33, 0.25, 1024] 
    s: [0.33, 0.50, 1024]
    m: [0.67, 0.75, 768]
    l: [1.00, 1.00, 512]
    x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f_Ghost, [128, True]] # 2 替换为 C2f_Ghost
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f_Ghost, [256, True]] # 4 替换为 C2f_Ghost
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_Ghost, [512, True]] # 6 替换为 C2f_Ghost
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f_Ghost, [1024, True]] # 8 替换为 C2f_Ghost
  - [-1, 1, SPPF, [1024, 5]]  # 9
  - [-1, 1, EMA, [1024]]      # 10 在 Backbone 末尾插入 EMA 注意力机制，提点！

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f_Ghost, [512]]  # 13 替换为 C2f_Ghost

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f_Ghost, [256]]  # 16 (P3/8-small) 替换为 C2f_Ghost

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f_Ghost, [512]]  # 19 (P4/16-medium) 替换为 C2f_Ghost

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5 (注意这里的索引变成了10，因为插入了EMA)
  - [-1, 3, C2f_Ghost, [1024]] # 22 (P5/32-large) 替换为 C2f_Ghost

  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)